game-bot/src/Catalogs/ВопросыИгры/ВопросыИгры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыИгры</name>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>Следующее</name>
      <type>
        <types>CatalogRef.ВопросыИгры</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

game-bot/src/CommonModules/ТелеграмИгра/Module.bsl
#Область ПрограммныйИнтерфейс

// Параметры:
//  ДанныеЭлемента - Структура
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента) Экспорт
	
	Message("Получено");	
	
	Если Не ДанныеЭлемента.Свойство("message") Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = ДанныеЭлемента.message;
	
	Если Не Сообщение.Свойство("from") Тогда
		Возврат;
	КонецЕсли;
		
	Если Не Сообщение.Свойство("text") Тогда
		Возврат;
	КонецЕсли;
		
	Отправитель = Сообщение.from.id;
	Текст = Сообщение.text;
	
	Message(Текст);
	Если СтрНачинаетсяС(Текст, "/start") Тогда
		НачатьИгру(Отправитель);
	КонецЕсли;
	
	//ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Текст);
	
КонецПроцедуры

Процедура НачатьИгру(Отправитель) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыИгры.Ссылка,
		|	ВопросыИгры.Текст,
		|	ВопросыИгры.Ответы.(
		|		Текст,
		|		Следующее)
		|ИЗ
		|	Справочник.ВопросыИгры КАК ВопросыИгры
		|ГДЕ
		|	ВопросыИгры.Код = &Код";
		
	Запрос.УстановитьПараметр("Код", 1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Message("Нет пролога!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();	
	ДополнительныеСвойства.Клавиатура = ВстроеннаяКлавиатураОтветов(Выборка.Ответы.Выбрать(), Выборка.Ссылка);
	
	ЭлементыВопроса = Новый Массив;
	
	ШаблонЗаголовка = "<b>%1</b>";
	ЭлементыВопроса.Добавить(СтрШаблон(ШаблонЗаголовка, Выборка.Наименование));
	
	ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, Выборка.Текст, ДополнительныеСвойства);

КонецПроцедуры

Функция ВстроеннаяКлавиатураОтветов(Ответы, Ссылка)
	
	ИндексКнопки = 0;
	СтрокиКлавиатуры = Новый Массив;
	СтрокаКлавиатуры = Новый Массив;
	
	Пока Ответы.Следующий() Цикл
		
		ИндексКнопки = ИндексКнопки + 1;
		
		ДанныеКнопки = Строка(Ссылка.УникальныйИдентификатор()) + "|" + XMLСтрока(Ответы.НомерСтроки);
		
		Кнопка = Новый Структура;
		Кнопка.Вставить("text", Ответы.Текст);
		Кнопка.Вставить("callback_data", ДанныеКнопки);
		
		СтрокаКлавиатуры.Добавить(Кнопка);
		
		Если ИндексКнопки >= 2 Тогда
			ИндексКнопки = 0;
			СтрокиКлавиатуры.Добавить(СтрокаКлавиатуры);
			СтрокаКлавиатуры = Новый Массив;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокаКлавиатуры.Количество() > 0 Тогда
		СтрокиКлавиатуры.Добавить(СтрокаКлавиатуры);
	КонецЕсли;		
	
	Клавиатура = Новый Структура;
	Клавиатура.Вставить("inline_keyboard", СтрокиКлавиатуры);
	
	Возврат Клавиатура;
	
КонецФункции

#КонецОбласти
